<a href="https://colab.research.google.com/github/hyunicecream/Inflearn/blob/main/1_1.%ED%8C%90%EB%8B%A4%EC%8A%A4%2C%EB%8D%B0%EC%9D%B4%ED%84%B0%ED%94%84%EB%A0%88%EC%9E%84%2C%EC%8B%9C%EB%A6%AC%EC%A6%88.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
%cd '/content/drive/MyDrive/Private_room/Inflearn/Pandas Data Analysis'

/content/drive/MyDrive/Private_room/Inflearn/Pandas Data Analysis

In [ ]:
data_frame =pd.read_csv('./data/friend_list.csv')
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45     managr
5  Chris   25     intern

데이터프레임은 무엇인가요?
가로축과 세로축이 있는 엑셀과 유사한 데이터구조입니다. 가로축은 로우(행), 세로축은 컬럼(열)이라고 합니다.

In [ ]:
data_frame.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45     managr

In [ ]:
data_frame.tail()

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45     managr
5  Chris   25     intern

시리즈는 무엇인가요?
데이터프레임의 컬럼(행)은 모두 시리즈입니다. 위의 예제는 3개의 시리즈로 구성된 데이터프레임입니다.

In [ ]:
type(data_frame.name) # 데이터프레임은 각각의 시리즈의 결합체이다.

pandas.core.series.Series

In [ ]:
list_tmp = [1,2,3]
list_tmp

[1, 2, 3]

시리즈는 단순히 파이썬 리스트를 간직한 오브젝트입니다.
리스트를 파라미터로 주면 바로 시리즈가 생성됩니다.
시리즈는 데이터 가공 및 분석이 파이썬 리스트보다 훨씬 쉽습니다.

In [ ]:
s1 = pd.core.series.Series([1,2,3])

In [ ]:
s2 = pd.core.series.Series(['one','two', 'three'])

In [ ]:
pd.DataFrame(data=dict(num=s1, word=s2))

   num   word
0    1    one
1    2    two
2    3  three